example.yml
config:
  target: "wss://http://localhost:1337/configs/"
  socketcluster:
  phases:
    - duration: 10 # Run scenario for 10 seconds
      arrivalCount: 20 # Create 20 virtual users per scenario
scenarios:
  - engine: "socketcluster"
    flow:
      - send:
          data: "John Doe"
          options: 
      - subscribe:
          channel: "channel name"
          options: 
      - think: 5 # do nothing for 5 seconds, then disconnect